
/**
 * Вопросы теста.
 */
const questions = [
    'This указывает',
    'Имя метода должно начинаться',
    'Имя функции-конструктора должно начинаться',
    'Свойство prototype это',
    'При использовании функции-конструктора методы объекта должны быть объявлены'

];

/**
 * Ответы на вопросы теста.
 */
const answers = [
    '1. на объект, который вызывает функцию\n2. на класс, в котором находится метод\n3. на объект, в котором находится вызываемый метод',
    '1. с маленькой буквы\n2. с большой буквы\n3. без разницы, работает и так, и так',
    '1. с большой буквы\n2. с маленькой буквы\n3. без разницы, работает и так, и так',
    '1. свойство готового объекта\n2. свойство функции-конструктора\n3. верны оба варианта',
    '1. в конструкторе\n2. в прототипе\n3. должны быть как отдельные функции'
];


/**
 * Номера правильных ответов.
 */
const trueAnswers = [1, 1, 1, 2, 2];